{
    "1": {
        "id": "1",
        "title": "Paint and Sip",
        "image": "https://cdn.pixabay.com/photo/2017/08/30/12/45/girl-2696947_1280.jpg",
        "year": "2025",
        "summary": "The Vietnamese Student Association proudly presents its Paint and Sip event, a vibrant gathering where creativity meets cultural appreciation. Attendees will enjoy a guided painting session featuring Vietnamese-inspired landscapes or cultural symbols, accompanied by bubble tea and traditional snacks. This event offers students a chance to unwind, socialize, and connect with Vietnamese art in a relaxed atmosphere. All skill levels are welcome, and all materials will be provided for participants.",
        "popular_activities": ["Guided painting", "Bubble tea tasting", "Cultural discussion", "Photo booth"]
    },
    "2": {
        "id": "2",
        "title": "Valentine's Day Table",
        "image": "https://cdn.pixabay.com/photo/2018/01/05/16/24/valentine-3063834_1280.jpg",
        "year": "2025",
        "summary": "The Vietnamese Student Association welcomes you to our Valentine's Day tabling event! Stop by our beautifully decorated booth to experience the intersection of Vietnamese culture and the celebration of love. Write love letters using Vietnamese calligraphy, enjoy heart-shaped bánh cookies, and learn about how Valentine's Day is celebrated in Vietnam compared to Western traditions. This interactive event provides a perfect opportunity to learn about cultural expressions of love while enjoying sweet treats and making personalized valentines.",
        "popular_activities": ["Vietnamese calligraphy", "Cultural comparison discussions", "Heart-shaped bánh cookies", "Photo station"]
    },
    "3": {
        "id": "3",
        "title": "Tet Celebration",
        "image": "https://cdn.pixabay.com/photo/2018/05/12/03/18/vietnam-3392154_1280.jpg",
        "year": "2025",
        "summary": "Join us for a vibrant celebration of Tet, the Vietnamese Lunar New Year! Our special event features enchanting musical performances from three talented artists of the Vietnamese Creative Society who will showcase traditional and contemporary Vietnamese songs. Immerse yourself in cultural displays including traditional dress (áo dài), lion dances, and festive decorations that symbolize prosperity and good fortune. Guests will enjoy authentic Vietnamese cuisine and participate in cultural activities like red envelope exchanges and traditional games.",
        "popular_activities": ["Musical performances", "Lion dance", "Traditional food tasting", "Cultural games", "Red envelope exchange"]
    },
    "4": {
        "id": "4",
        "title": "Study Hall",
        "image": "https://cdn.pixabay.com/photo/2018/03/31/06/31/people-3277468_1280.jpg",
        "year": "2025",
        "summary": "Join the Vietnamese Student Association for our Study Hall event, where productivity meets community! This dedicated study session offers a supportive environment for students to focus on academics while connecting with peers. Fuel your study session with complimentary Vietnamese coffee and snacks that provide the perfect brain boost. Our Study Hall features designated quiet zones, group work areas, and study resources to accommodate different learning styles. VSA officers will be available to provide academic support and facilitate connections between students studying similar subjects.",
        "popular_activities": ["Quiet study areas", "Group work spaces", "Vietnamese coffee bar", "Tutoring resources"]
    },
    "5": {
        "id": "5",
        "title": "Poetry Night",
        "image": "https://cdn.pixabay.com/photo/2023/05/17/15/56/coffee-shop-8000132_1280.jpg",
        "year": "2024",
        "summary": "Join us for an enchanting evening at the Vietnamese Student Association's Poetry Night, where words and emotions come alive in a celebration of creative expression. Experience powerful performances featuring both Vietnamese and English poetry that explores themes of identity, diaspora, heritage, and personal journeys. Our welcoming atmosphere encourages all attendees to share their original work during our open mic session, creating a space for diverse voices. The event features ambient music, atmospheric decorations, and Vietnamese tea service that enhances the immersive artistic experience.",
        "popular_activities": ["Bilingual poetry readings", "Open mic session", "Tea ceremony", "Literary discussions"]
    },
    "6": {
        "id": "6",
        "title": "Game Night",
        "image": "https://cdn.pixabay.com/photo/2017/09/08/20/29/chess-2730034_1280.jpg",
        "year": "2024",
        "summary": "Join the Vietnamese Student Association for an exciting Game Night filled with fun, laughter, and friendly competition! Experience a diverse selection of games including traditional Vietnamese games like Ô ăn quan and Cờ tướng (Vietnamese chess), alongside popular board games and video game tournaments. Our game stations cater to both competitive players and those seeking casual entertainment in a social setting. Throughout the night, enjoy Vietnamese snacks and refreshments that fuel the gaming experience while creating a festive atmosphere for making new friends.",
        "popular_activities": ["Traditional Vietnamese games", "Board game competitions", "Video game tournaments", "Snack bar"]
    },
    "7": {
        "id": "7",
        "title": "Field Day",
        "image": "https://cdn.pixabay.com/photo/2016/11/29/09/43/field-1868884_1280.jpg",
        "year": "2024",
        "summary": "Join the Vietnamese Student Association for our action-packed Field Day event! Participate in a variety of outdoor activities and sports including Vietnamese shuttlecock kicking (đá cầu), relay races, tug-of-war, and volleyball matches designed for all skill levels. Our event promotes physical activity, teamwork, and healthy competition in a welcoming environment. Participants can enjoy refreshing Vietnamese beverages like sugarcane juice and coconut water to stay hydrated throughout the day of outdoor fun and community building.",
        "popular_activities": ["Đá cầu (shuttlecock kicking)", "Relay races", "Tug-of-war", "Volleyball matches"]
    },
    "8": {
        "id": "8",
        "title": "Night Market",
        "image": "https://cdn.pixabay.com/photo/2021/01/05/14/34/hanoi-5892343_1280.jpg",
        "year": "2023",
        "summary": "Experience the vibrant sights, sounds, and flavors of Vietnam at the VSA Night Market! Our indoor market recreates the bustling atmosphere of Vietnamese night markets with colorful lanterns, aromatic food stalls, and lively music. Explore vendor booths featuring student entrepreneurs selling crafts, art, and goods inspired by Vietnamese culture. Sample a diverse selection of authentic Vietnamese street foods prepared by VSA members and local restaurants. Cultural demonstrations throughout the evening showcase traditional crafts and performing arts for an immersive experience.",
        "popular_activities": ["Street food sampling", "Cultural performances", "Vendor shopping", "Lantern making"]
    },
    "9": {
        "id": "9",
        "title": "ACE Reveal Party",
        "image": "https://cdn.pixabay.com/photo/2016/11/29/13/24/balloons-1869790_1280.jpg",
        "year": "2023",
        "summary": "Join us for the highly anticipated Anh Chi Em (ACE) Family Reveal Party hosted by the Vietnamese Student Association! This special ceremony pairs new VSA members with upperclassmen mentors in our unique family system that provides guidance, friendship, and support throughout the academic year. Experience the excitement as new members discover their ACE families through creative and surprising reveal activities designed to create meaningful connections. The celebration features team-building games, a shared Vietnamese meal, and family photo sessions to commemorate the beginning of these important relationships.",
        "popular_activities": ["Family reveal ceremony", "Team building games", "Family photos", "Vietnamese banquet"]
    },
    "10": {
        "id": "10",
        "title": "Mid Autumn Festival",
        "image": "https://cdn.pixabay.com/photo/2019/09/10/13/46/lantern-festival-4466564_1280.jpg",
        "year": "2023",
        "summary": "Join us for the Vietnamese Student Association's Mid-Autumn Festival! Celebrate this important cultural holiday with traditional performances, lantern making, and mooncake tasting. Learn about the mythology and significance behind this harvest festival through interactive displays and storytelling sessions. Children from local Vietnamese-American families will perform traditional dances and songs, creating an authentic community celebration. Participants will create their own paper lanterns, enjoy tea ceremonies, and sample various types of mooncakes in this family-friendly cultural event.",
        "popular_activities": ["Lantern making", "Mooncake tasting", "Traditional performances", "Storytelling"]
    }
}